Hi @EugenFo
This is weird thing, but you must put comma at the end of the list:
```
  whitelists = [
    {
      group_name = "test-group"
      ip_list = ["192.168.0.0/24", "172.20.128.0/24",]
    }
  ]
```
Vars:
```
configuration = [
  {
    parameter_id = "2"
    parameter_name = "maxmemory-policy"
    parameter_value = "allkeys-lru"
  },
  {
    parameter_id = "11"
    parameter_name = "maxclients"
    parameter_value = "1002"
  }
]
whitelists = [
  {
    group_name = "test-group-name"
    ip_list    = ["10.10.10.1", "10.10.10.2",]
  },
  {
    group_name = "test-group-name-2"
    ip_list    = ["10.11.10.1/24", "10.11.10.2/24",]
  }
]
```
Plan output:
```
Terraform will perform the following actions:

  # opentelekomcloud_dcs_instance_v1.this will be created
  + resource "opentelekomcloud_dcs_instance_v1" "this" {
      + available_zones     = [
          + "bf84aba586ce4e948da0b97d9a7d62fb",
        ]
      + capacity            = 0.125
      + created_at          = (known after apply)
      + description         = (known after apply)
      + enable_whitelist    = false
      + engine              = "Redis"
      + engine_version      = "5.0"
      + id                  = (known after apply)
      + internal_version    = (known after apply)
      + ip                  = (known after apply)
      + maintain_begin      = (known after apply)
      + maintain_end        = (known after apply)
      + max_memory          = (known after apply)
      + name                = "dcs-test"
      + order_id            = (known after apply)
      + password            = (sensitive value)
      + port                = (known after apply)
      + product_id          = "redis.ha.xu1.tiny.r2.128-h"
      + resource_spec_code  = (known after apply)
      + security_group_name = (known after apply)
      + status              = (known after apply)
      + subnet_id           = "44ed75f0-65df-4865-b4d9-4565fc56e2f1"
      + subnet_name         = (known after apply)
      + used_memory         = (known after apply)
      + user_id             = (known after apply)
      + user_name           = (known after apply)
      + vpc_id              = "16dbd25d-c55c-405b-9e56-11b03e7e7dc1"
      + vpc_name            = (known after apply)

      + backup_policy {
          + backup_at   = [
              + 4,
            ]
          + backup_type = "manual"
          + begin_at    = "00:00-01:00"
          + period_type = "weekly"
          + save_days   = 1
        }

      + configuration {
          + parameter_id    = "2"
          + parameter_name  = "maxmemory-policy"
          + parameter_value = "allkeys-lru"
        }
      + configuration {
          + parameter_id    = "11"
          + parameter_name  = "maxclients"
          + parameter_value = "1002"
        }

      + whitelist {
          + group_name = "test-group-name"
          + ip_list    = [
              + "10.10.10.1",
              + "10.10.10.2",
            ]
        }
      + whitelist {
          + group_name = "test-group-name-2"
          + ip_list    = [
              + "10.11.10.1/24",
              + "10.11.10.2/24",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
